backend/app/graphql/mutations/create_article.rb

INSERT INTO `articles` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('ゲーマー向け周辺機器がAmazonで安いらしい', 'プロゲーマーがみとめるPS4向け機器が安いらしい', 1, '2019-02-19 15:35:14', '2019-02-19 15:35:14')
---
  def resolve(user_id:, title:, body:)
    article = Article.new(title: title, body: body, user_id: user_id)
    if article.save