backend/app/graphql/mutations/delete_article.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1
---
  def resolve(id:)
    article = Article.find(id)
    article.destroy