backend/app/graphql/types/query_type.rb

    def article(id:)
      Article.find(id)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1